[
  {
    "id": 1,
    "category": "update",
    "title": "Akhir Perjalanan Sultan Haikal, Hacker Muda Asal Tangerang Selatan",
    "image": "https://faktabanten.co.id/wp-content/uploads/2017/04/images-29.jpg",
    "postedDate": "20 February 2025",
    "lastModified": "20 February 2025",
    "postinguser": "admin",
    "description": "Haikal kini meringkuk di tahanan Bareskrim Polri. Dia ditangkap Tim Subdit 1 Direktorat Tindak Pidana Siber (Dittipidsiber) Bareskrim Polri pada Kamis (30/3/2017) lalu di rumahnya.",
    "content": "“Pelaku sudah pernah melakukan hacking terhadap situs di dalam negeri maupun luar negeri sebanyak 4.237 kali,” jelas Kasubdit 1 Dittipidsiber Bareskrim AKBP Idham Wasriadi, Minggu (2/4/2017).",
    "content2": "Sudah setahun lebih Haikal melancarkan aksinya. Haikal tidak bermain sendiri, ada anak buahnya yang membantu, yakni MKU (19), NTM (20), dan Al (27). Mereka menamakan dirinya 'Gantengers Crews'.",
    "content3": "Polisi menangkap lebih dahulu anak buah Haikal di Balikpapan, Kalimantan Timur. Para pelaku memang aktif di Facebook dan aktif di akun Gantengers Crew. Tiket pesawat hasil pembobolan dijual di akun ini. Anak buah Haikal juga hanya lulusan SMA.",
    "content4": "“Kata pelaku gampang dan mudah meretas,” beber Idham. Dari mana pelaku mendapatkan pengetahuan meretas? Hasil pemeriksaan, Haikal belajar dari otodidak alias lewat Google. Jadi, dia belajar lewat internet dan mempraktikannya.",
    "link": "./A01/?id=1",
    "detailPage": "./?id=1"
  },
  {
    "id": 2,
    "category": "update",
    "title": "Serangan Siber Terhadap Indonesia Meningkat | Hacker Indonesia Vs Hacker Malaysia",
    "image": "https://naval-csirt.tnial.mil.id/wp-content/uploads/2025/02/CyberWar1-705x438.jpeg",
    "postedDate": "20 February 2025",
    "lastModified": "20 February 2025",
    "postinguser": "admin",
    "description": "Perang Siber Meletus: Peretas Malaysia dan Indonesia Meluncurkan Serangan Balasan! tulis akun tersebut pada Selasa 18 Februari 2025. Situasi perang siber antara Indonesia vs Malaysia disebut telah meningkatkan ketegangan antara kedua negara.",
    "content": "source : TNI-AL News | Peristiwa penembakan Pekerja Migran Indonesia (PMI) di Morib, Selangor, jadi pemicu aksi saling balas serangan siber antara dua negara serumpun ini. Konflik bermula setelah petugas Badan Penegakan Hukum Maritim Malaysia menembaki sebuah kapal yang membawa pekerja migran Indonesia di Selangor.",
    "content2": "Peristiwa ini mengakibatkan satu orang Indonesia tewas dan empat lainnya luka-luka. Sebagai balasan, kelompok hacker Indonesia melancarkan serangan siber ke situs web pemerintah Malaysia, merusaknya, dan membocorkan data sensitif.",
    "content3": "Namun, perang tidak berhenti di situ. Hacker Malaysia kemudian membalas, dengan menargetkan infrastruktur pemerintah Indonesia. Kelompok peretas Malaysia “STUCX TEAM” mengklaim telah meretas lebih dari 1.000 situs web terkait militer Indonesia, menyusup ke sistem CCTV, dan membahayakan infrastruktur penting.",
    "content4": "Sebagai tanggapan, kelompok hacker Indonesia “IndoHaxSec” bersumpah akan mengungkap database pemerintah Malaysia dan mengklaim telah membocorkannya di dark web. “Dengan kedua belah pihak meningkatkan perang siber, medan pertempuran digital antara Malaysia dan Indonesia semakin intensif – dan tidak ada pihak yang tampaknya siap untuk mundur,” tulis akun tersebut.",
    "link": "./A01/?id=2",
    "detailPage": "./?id=2"
  },
  {
    "id": 3,
    "category": "security",
    "title": "Penemuan Bug SQLi dan Rooting di server kecil milik tni-au.mil.id",
    "image": "../../../imej/proof/prooftniau1.jpeg",
    "proof": "../../../imej/proof/prooftniau2.jpeg",
    "postedDate": "20 February 2025",
    "lastModified": "20 February 2025",
    "postinguser": "admin",
    "description": "Salah Satu anggota TSecNetwork berhasil mengamankan salah satu subdomain milik TNI-AU dari penyerang lain. ./SaklarRusak berhasil masuk server dan membatasi akses pengunjung di website dan melakukan penghapusan beberapa file yang menyebabkan kerentanan terhadap SQLi tersebut sudah tidak bisa di eksploitasi.",
    "content": "Lebih lanjut, ./SaklarRusak menemukan bug SQLi tepatnya di server NagiosQL. Dengan menggunakan alat seperti SQLmap, ia berhasil masuk ke dashboard aplikasi NagiosQL.Dari sana, ./SaklarRusak dapat memantau alur dan jalur router milik Markas Besar Angkatan Udara (MabesAU). Bahkan, ia berhasil mengidentifikasi jenis-jenis database dan host yang digunakan oleh MabesAU. Akses ini sebenarnya memungkinkan serangan lanjutan, seperti menghubungkan Remote Desktop Protocol (RDP) ke setiap host yang tersedia.",
    "content2": "Namun, ./SaklarRusak memilih untuk tidak mengambil keuntungan dari situasi ini.Alih-alih mengeksploitasi kerentanan tersebut, ./SaklarRusak mencoba melaporkan temuan ini kepada CSIRT TNI-AU melalui email. Sayangnya, setelah menunggu lebih dari 10 jam, tidak ada respon yang diterima. Merasa situasi semakin mendesak, ./SaklarRusak memutuskan untuk mengambil tindakan lebih lanjut. Ia mengunggah backdoor dan melakukan rooting terhadap server tersebut untuk mengamankannya.Mengapa ./SaklarRusak melakukan hal ini? Pada hari yang sama, beberapa komunitas dan tim peretas, terutama dari Malaysia dengan nama StucXTeam, sedang gencar menargetkan domain-domain milik TNI-AU (mil.id).",
    "content3": " Jika ./SaklarRusak hanya melaporkan kerentanan tanpa mengambil tindakan lebih lanjut, dikhawatirkan penyerang lain akan memanfaatkan celah tersebut sebelum pihak berwenang sempat merespons. Namun, tindakan ini juga memiliki risiko hukum, karena memperbaiki sistem tanpa izin dapat dianggap sebagai pelanggaran UU-ITE terkait akses ilegal ke sistem komputer. Untuk melindungi dirinya sendiri, ./SaklarRusak memutuskan untuk menghapus pesan email yang telah dikirim dan melanjutkan perbaikan secara mandiri. Meskipun tindakan ini dilakukan dengan niat baik, ia menyadari bahwa langkah tersebut bisa dianggap kontroversial dan berpotensi melanggar hukum. Namun, prioritas utamanya adalah memastikan bahwa sistem TNI-AU aman dari ancaman yang lebih serius.",
    "link": "./A01/?id=3",
    "detailPage": "./?id=3"
  },
  {
    "id": 4,
    "category": "security",
    "title": "Terdapat Celah Keamanan XSS pada bmkg.go.id",
    "image": "https://aliefmedia.id/wp-content/uploads/2025/02/BMKG.jpeg",
    "postedDate": "20 February 2025",
    "lastModified": "20 February 2025",
    "postinguser": "admin",
    "description": "Salah satu anggota TSecNetwork Menemukan Kerentanan XSS pada domain bmkg.go.id, ./SaklarRusak Menemukan kerentanan pada system keycloak yang digunakan oleh bmkg.go.id, dengan indikasi 500 Internal Server Error, mengidentifikasikan bahwa terjadi bug IDOR didalamnya",
    "content": "Bug Tersebut memungkinkan kita dapat memasukkan payload javascript di dalamnya..",
    "link": "./A01/?id=4",
    "detailPage": "./?id=4"
  },
  {
    "id": 5,
    "category": "update",
    "title": "Jaringan Kejahatan Siber Lazarus: Mengelola Dana Crypto Senilai Rp15 Triliun",
    "image": "https://cdn.prod.website-files.com/64e50cbe2b6f932c04238c14/66db1e70e0bd1a90a311380b_lazarus-logo.webp",
    "postedDate": "20 February 2025",
    "lastModified": "20 February 2025",
    "postinguser": "admin",
    "description": "Jakarta, Pintu News – Kelompok peretas terkenal, Lazarus Group, yang diduga beroperasi dengan dukungan Korea Utara, telah mengumpulkan aset cryptocurrency senilai hampir Rp15,1 triliun ($919 juta). Jaringan ini dikenal sebagai salah satu organisasi kejahatan siber terbesar di dunia, dengan jejak peretasan di berbagai platform kripto global.",
    "content": "Pada 21 Februari 2025, bursa kripto terpusat Bybit menjadi korban peretasan besar senilai Rp23,1 triliun ($1,4 miliar). Bukti forensik mengarah pada Lazarus Group, yang juga dikenal dengan berbagai alias seperti Hidden Cobra, Nickel Academy, Diamond Sleet, dan Whois Team. ",
    "content2": "Dari total 499.000 Ethereum ETH2.29%->Harga ETH Saat Ini Rp 36.020.272 - 2.29% - Market Cap - Rp 7.444 Triliun - Volume Trading - Rp 594,65 Triliun - Suplai Beredar - Rp 120.452.072 - yang dicuri dalam serangan Bybit, Lazarus telah mendistribusikan kembali 424.330 ETH ke berbagai dompet. Hingga saat ini, kelompok tersebut masih menguasai sekitar 236.283 ETH senilai Rp9,8 triliun ($592,78 juta) dari serangan ini serta peretasan mereka sebelumnya.",
    "link": "./A01/?id=5",
    "detailPage": "./?id=5"
  },
  {
    "id": 6,
    "category": "update",
    "title": "Harga Bitcoin Hari Ini: Turun ke $84rb Karena Rencana Cadangan Strategis Trump Mengecewakan",
    "image": "https://i-invdn-com.investing.com/news/Bitcoin_800x533_L_1645008708.jpg",
    "postedDate": "20 February 2025",
    "lastModified": "20 February 2025",
    "postinguser": "admin",
    "description": "Investing.com - Bitcoin jatuh pada hari Jumat setelah Presiden AS Donald Trump mengumumkan cadangan strategis untuk kripto yang memicu sedikit kegembiraan, mengingat tidak ada pembelian aset digital yang didanai pemerintah.",
    "content": "Namun, cadangan Bitcoin Trump disambut dengan antusiasme yang terbatas dari pasar kripto. Meskipun para pedagang menyambut baik peningkatan pengakuan kripto oleh pemerintah AS, kurangnya pembelian koin baru berarti bahwa pembentukan cadangan tersebut hanya akan berdampak kecil pada pasar.",
    "content2": "Analis TD Cowen mengatakan bahwa meskipun pesanan Bitcoin Trump bukanlah cadangan Bitcoin yang agresif seperti yang diteriakkan oleh beberapa orang, hal itu masih merupakan hal yang positif di Gedung Putih yang menandakan dukungan untuk aset digital.",
    "content3": "Harga kripto yang lebih luas melacak penurunan Bitcoin, karena perintah Trump untuk persediaan aset digital altcoin juga memicu sedikit kegembiraan. Perintah Trump mengatakan bahwa persediaan tersebut juga akan dibuat dari kripto yang disita, dan tidak akan melibatkan pembelian baru dari kripto yang terdaftar.",
    "content4": "",
    "link": "./A01/?id=6",
    "detailPage": "./?id=6"
  },
  {
    "id": 7,
    "category": "event",
    "title": "TSecNetwork Membuka jasa pencarian kerentanan pada website swasta maupun pemerintahan",
    "image": "https://ids.ac.id/wp-content/uploads/2023/06/Menjadi-Bug-Hunter-1024x576.jpg",
    "postedDate": "20 February 2025",
    "lastModified": "20 February 2025",
    "postinguser": "admin",
    "description": "kami membuka jasa pentesting serta pencarian bug pada aplikasi web",
    "content": "hubungi saya untuk informasi lebih lanjut ------------------------------->             email: severityhunting1337@protonmail.com",
    "link": "./A01/?id=7",
    "detailPage": "./?id=7"
  }
]